louis35791/stm32f7xx_grbl/Core/Src/step.c
    // Infinite loop
    for (;;)
    {
        // prepare pulse data
        if ((generalNotification & GENERAL_NOTIFICATION_CALCULATE_PULSE))
        {
            // calculate pulse data
            stepper_pulse_generation_isr();
        }

        // check if there is a notification to resume DMA stream asking from the timer interrupt
        if (!(generalNotification & GENERAL_NOTIFICATION_DATA_NOT_AVAILABLE_ALL_AXES))
        {
            continue;
        }

        // check if there is any buffer available
        if (stepRingBufferGetTail(Z_AXIS) == UINT16_MAX)
        {
            continue;
        }

        // check if it is the "First Time" to start the process
        if (generalNotification & GENERAL_NOTIFICATION_FIRST_TIME_START)
        {
            // set up each axis
            for (int8_t i = NUM_DIMENSIONS - 1; i >= 0; i--)
            {
                // get timer and DMA parameters of this axis
                TIM_DMA_Parameters_t *timDMAParamsPulse = &axisTimerDMAParams[i];

                // reset timer
                __HAL_TIM_SetCounter(timDMAParamsPulse->htim, 0);

                // get available data address
                uint32_t address = stepGetAvailableDataAddress(i);
                uint8_t dirOutputBit = GET_DIRECTION_BIT_FROM_AXIS(i);
                volatile uint32_t *pDirOutputPort = GET_DIRECTION_PORT_FROM_AXIS(i);

                // set the direction output bit according to the dir_outbit
                *pDirOutputPort = (*pDirOutputPort & ~(1 << dirOutputBit)) | (((pulse_t *)address)->dir_outbit);

                // start timer output mode with DMA stream
                stepTimeOCStartDMA(timDMAParamsPulse->htim, timDMAParamsPulse->TIM_CHANNEL, (uint32_t *)address, ((pulse_t *)address)->length);

                // determine if this axis is active or not by checking motion_control_state coming with the pulse data
                if (((pulse_t *)address)->motion_control_state & (1 << i))
                {
                    // set the axis to active
                    currentStepperState |= (1 << i);

                    // generate compare event
                    HAL_TIM_GenerateEvent(timDMAParamsPulse->htim, timDMAParamsPulse->CompareEventID);

                    // check if it is the master timer
                    if (timDMAParamsPulse->htim != &MASTER_TIM_HANDLE)
                    {
                        // enable the timer
                        __HAL_TIM_ENABLE(timDMAParamsPulse->htim);
                    }
                }
                else // this axis is not active
                {
                    // set the axis to idle
                    currentStepperState &= ~(1 << i);

                    // force output pin to low in output compare mode
                    FORCE_OC_OUTPUT_LOW(timDMAParamsPulse->htim, timDMAParamsPulse->TIM_ACTIVE_CHANNEL);
                }
            }

            // enable the master timer
            __HAL_TIM_ENABLE(&MASTER_TIM_HANDLE);

            // clear the flag
            generalNotification &= ~GENERAL_NOTIFICATION_DATA_NOT_AVAILABLE_ALL_AXES;
            generalNotification &= ~GENERAL_NOTIFICATION_FIRST_TIME_START;
        }
        // NOT the "First Time" to start the process, but out of data asking from the timer interrupt
        else
        {
            // set PD5 to high ===> signal the start of resuming DMA stream
            HAL_GPIO_WritePin(GPIOD, GPIO_PIN_5, GPIO_PIN_SET);

            // set up each axis
            for (uint8_t i = 0; i < NUM_DIMENSIONS; i++)
            {
                // determine which axis notified that it is out of data
                if (generalNotification & GET_DATA_NOT_AVAILABLE_BIT(i))
                {
                    // get available data address
                    uint32_t address = stepGetAvailableDataAddress(i);

                    // check if the address is valid
                    if (address != 0)
                    {
                        // update DMA buffer
                        stepUpdateDMABuffer(axisTimerDMAParams[i].htim, address, i);

                        // reset the flag in general notification
                        generalNotification &= ~GET_DATA_NOT_AVAILABLE_BIT(i);

                        // restart counter
                        TIM_START_COUNTER(MASTER_TIM_HANDLE);
                    }
                    else
                    {
                        // should not reach here, because the 3-axis data is calculated simultaneously
                        Error_Handler();
                    }
                }
            }

            // set PD5 to low ===> signal the end of resuming DMA stream
            HAL_GPIO_WritePin(GPIOD, GPIO_PIN_5, GPIO_PIN_RESET);
        }

    }
}

HAL_StatusTypeDef stepCalculatePulseData(uint32_t *st_addr)
{
    // set PD4 to high ===> signal the start of pulse calculation
    HAL_GPIO_WritePin(GPIOD, GPIO_PIN_4, GPIO_PIN_SET);

    static uint8_t getNewBuffer = (1 << NUM_DIMENSIONS) - 1; // bit 0: x axis, bit 1: y axis, bit 2: z axis
    static pulse_t *pulse[NUM_DIMENSIONS] = {0};
    static IO_TYPE dirOutputBits = 0;

    stepper_t *st = (stepper_t *)st_addr;

    // loop through all axes
    for (uint8_t i = 0; i < NUM_DIMENSIONS; i++)
    {
        // get timer and DMA parameters of this axis
        TIM_DMA_Parameters_t *timDMAParamsPulse = &axisTimerDMAParams[i];
        uint8_t step_bit = timDMAParamsPulse->Step_Bit;
        uint8_t dir_bit = timDMAParamsPulse->Dir_Bit;
        static uint8_t privateMotionState = 0; // a private motion state tracker for each axis

        // determine if a new buffer is needed
        if (getNewBuffer & (1 << i) || (dirOutputBits != st->dir_outbits))
        {

            // get new buffer
            pulse[i] = (pulse_t *)stepGetFreeDataAddress(i);

            // check if the buffer is available
            if (pulse[i] == 0)
            {
                // set PD4 to low ===> signal the end of pulse calculation
                HAL_GPIO_WritePin(GPIOD, GPIO_PIN_4, GPIO_PIN_RESET);

                return HAL_BUSY;
            }

            // reset buffer length
            pulse[i]->length = 0;

            // reset motion control state
            pulse[i]->motion_control_state = 0;
            privateMotionState = 0;

            // set direction state
            pulse[i]->dir_outbit = st->dir_outbits & (1 << dir_bit);

            // reset the flag
            getNewBuffer &= ~(1 << i);

