louis35791/stm32f7xx_grbl/Core/Src/step.c
            // update direction output bits
            dirOutputBits = st->dir_outbits;
        }

        // determine if a pair of pulse data should be added in this axis or not by Bresenham line algorithm.
        // a pair of pulse data consists of a pulse data for the on state and a pulse data for the off state.
        uint16_t buf_length = pulse[i]->length;

        if (st->step_outbits & (1 << step_bit))
        {
            // set this axis to ACTIVE state
            privateMotionState |= (1 << i);

            // add pulse data
            // add ON state pulse data
            pulse[i]->data[buf_length++] = currentCounterValue;
            // add OFF state pulse data
            pulse[i]->data[buf_length++] = currentCounterValue + st->step_pulse_time;

            // update the length of available data
            pulse[i]->length = buf_length;

            // check if the buffer is full
            if (buf_length >= DOUBLE_BUFFER_SIZE)
            {
                // set the flag to get new buffer
                getNewBuffer |= (1 << i);
            }
        }

        // update motion control state for this axis
        pulse[i]->motion_control_state = privateMotionState;
    }

    // update variables
    currentCounterValue += st->exec_segment->cycles_per_tick;

    // check if any buffer is full of data
    if (getNewBuffer)
    {
        // atomic operation
        __disable_irq();

        // increment head
        stepRingBufferIncrementHead(X_AXIS);
        stepRingBufferIncrementHead(Y_AXIS);
        stepRingBufferIncrementHead(Z_AXIS);

        // atomic operation
        __enable_irq();

        getNewBuffer = (1 << NUM_DIMENSIONS) - 1;
    }

    // set PD4 to low ===> signal the end of pulse calculation
    HAL_GPIO_WritePin(GPIOD, GPIO_PIN_4, GPIO_PIN_RESET);

    return HAL_OK;
}

void stepUpdateDMABuffer(TIM_HandleTypeDef *htim, uint32_t address, axis_t axis)
{
    // set PD7 to high ===> signal the start of updating DMA buffer
    HAL_GPIO_WritePin(GPIOD, GPIO_PIN_7, GPIO_PIN_SET);

    uint8_t dirOutputBit = GET_DIRECTION_BIT_FROM_AXIS(axis);
    volatile uint32_t *pDirOutputPort = GET_DIRECTION_PORT_FROM_AXIS(axis);
    uint8_t upcomingAxesActiveState = 0;

    // get upcoming axes active state
    upcomingAxesActiveState = ((pulse_t *)address)->motion_control_state;

    // check if this axis shall be put into idle or not
    if (!(upcomingAxesActiveState & (1 << axis))) // no pulsed data to be sent
    {
        // set the axis to idle
        currentStepperState &= ~(1 << axis);

        // force output pin to low in output compare mode
        FORCE_OC_OUTPUT_LOW(htim, axisTimerDMAParams[axis].TIM_ACTIVE_CHANNEL);
    }
    else // still has pulsed data to be sent
    {
        // set the axis to active
        currentStepperState |= (1 << axis);

        // set the direction output bit according to the dir_outbit
        *pDirOutputPort = (*pDirOutputPort & ~(1 << dirOutputBit)) | (((pulse_t *)address)->dir_outbit);

        // resume DMA stream with updated buffer and length
        RESUME_DMA_STREAM_WITH_TC(htim->hdma[GET_TIM_DMA_ID_FROM_AXIS(axis)], address, ((pulse_t *)address)->length);
    }

    // set the axis that its DMA transfer is completed
    DMAUpdatedAxes |= (1 << axis);

    /**
     * Check if there is any axis that shall be re-enabled from idle
     */
    // check if there is any bit that is set to 0 in currentStepperState
    // and the corresponding bit is set to 1 in upcomingAxesActiveState.
    // make these axes which shall be re-enabled from idle
    uint8_t axisToBeReEnabled = (currentStepperState ^ upcomingAxesActiveState) & upcomingAxesActiveState;

    // manual update those axes that shall be re-enabled from idle and will stay in idle state in the upcoming cycle
    // to avoid update the same axis twice,
    if (DMAUpdatedAxes != ((1 << NUM_DIMENSIONS) - 1))
    {
        // loop through all axes
        for (uint8_t i = 0; i < NUM_DIMENSIONS; i++)
        {
            // check if this axis has been updated
            if (DMAUpdatedAxes & (1 << i))
            {
                // skip this axis
                continue;
            }
            // check if this axis shall be re-enabled from idle
            else if (axisToBeReEnabled & (1 << i))
            {
                // set the axis to active
                currentStepperState |= (1 << i);

                // get available data address
                address = stepGetAvailableDataAddress(i);
                dirOutputBit = GET_DIRECTION_BIT_FROM_AXIS(i);
                pDirOutputPort = GET_DIRECTION_PORT_FROM_AXIS(i);

                // check if the address is valid
                if (address != 0)
                {
                    // set the direction output bit according to the dir_outbit
                    *pDirOutputPort = (*pDirOutputPort & ~(1 << dirOutputBit)) | (((pulse_t *)address)->dir_outbit);

                    // resume DMA stream with updated buffer and length
                    RESUME_DMA_STREAM_WITH_TC(axisTimerDMAParams[i].htim->hdma[axisTimerDMAParams[i].TIM_DMA_ID], address, ((pulse_t *)address)->length);

                    // generate compare event to trigger the DMA transfer
                    HAL_TIM_GenerateEvent(axisTimerDMAParams[i].htim, axisTimerDMAParams[i].CompareEventID);

                    // force output turned into toggle mode
                    FORCE_OC_OUTPUT_TOGGLE(axisTimerDMAParams[i].htim, axisTimerDMAParams[i].htim->Channel);
                }
                else
                {
                    // should not reach here, because the 3-axis data is calculated simultaneously
                    Error_Handler();
                }

                // set this axis that its DMA buffer has been updated
                DMAUpdatedAxes |= (1 << i);
            }
            else if (!(currentStepperState & (1 << i)))
            {
                // still in idle state
                // take the data out of the ring buffer to let the head be able to move forward
                stepGetAvailableDataAddress(i);

                // set this axis that its DMA buffer has been updated
                DMAUpdatedAxes |= (1 << i);
            }
        }
    }

    /**
     * Update Variables
     */
    // check if all axes have completed their DMA transfer
    if (DMAUpdatedAxes == (1 << NUM_DIMENSIONS) - 1)
    {
        // reset the axes that their DMA transfer is completed
        DMAUpdatedAxes = 0;

        // set generatl notification to all axes have completed their DMA transfer
        generalNotification |= GENERAL_NOTIFICATION_ALL_AXES_DMA_UPDATED;
    }

    // set PD7 to low ===> signal the end of updating DMA buffer
    HAL_GPIO_WritePin(GPIOD, GPIO_PIN_7, GPIO_PIN_RESET);
}

