louis35791/stm32f7xx_grbl/Core/Src/step.c
/* =========================================================== */
/*                   DMA Transfer Complete ISR                 */
/* =========================================================== */
/**
 * @brief  TIM DMA Pulse complete callback.
 */
void HAL_TIM_PWM_PulseFinishedCallback(TIM_HandleTypeDef *htim)
{
    // stop counter
    TIM_STOP_COUNTER(MASTER_TIM_HANDLE); // timer x axis

    // set PD6 to high ===> signal the start of ISR
    HAL_GPIO_WritePin(GPIOD, GPIO_PIN_6, GPIO_PIN_SET);

    // identify the axis
    axis_t axis = GET_AXIS_FROM_TIM_HANDLE(htim);

    // suspend DMA stream
    // ==> to update DMA buffer length and address, DMA stream should be suspended
    SUSPEND_DMA_STREAM(htim->hdma[GET_TIM_DMA_ID_FROM_AXIS(axis)]);

    /**
     * Here we disable the following checking for a better performance.
     */
    // if (axis == NUM_DIMENSIONS)
    // {
    //     // resume counter
    //     TIM_START_COUNTER(MASTER_TIM_HANDLE); // timer x axis

    //     // set PD6 to low ===> signal the end of ISR
    //     HAL_GPIO_WritePin(GPIOD, GPIO_PIN_6, GPIO_PIN_RESET);

    //     return;
    // }

    /**
     * Start Update DMA buffer
     */
    // get the available data address
    uint32_t address = stepGetAvailableDataAddress(axis);

    // check if the address is valid
    if (address != 0)
    {
        stepUpdateDMABuffer(htim, address, axis);

        // restart counter
        TIM_START_COUNTER(MASTER_TIM_HANDLE);
    }
    else
    {
        // notify main task to update pulse data
        generalNotification |= GET_DATA_NOT_AVAILABLE_BIT(axis);
    }

    // set PD6 to low ===> signal the end of ISR
    HAL_GPIO_WritePin(GPIOD, GPIO_PIN_6, GPIO_PIN_RESET);
}

/* =========================================================== */
/*       Assistant Functions for Ring buffer management        */
/* =========================================================== */
/**
 * Ring Buffer Manipulation Functions
 */
uint16_t stepRingBufferGetNext(axis_t axis)
{
    /**
     * In order to avoid the data updating overwriting the data used by DMA,
     * the head and tail pointers are separated by a gap of N buffers.
     * N is defined by GAP_HEAD_TAIL. Howerver, instead of tracking the gap
     * to determine if there is a next free index, here we simply check if
     * the length of the populated data of ring buffer is less than
     * RING_BUFFER_SIZE - GAP_HEAD_TAIL.
     *
     * i.e.
     * | * | * | * | (Head)>> | 0 | 0 | >>(Tail) | * | * | * |
     * >-------- Body ------->|  GAP  |>------- Body -------->
     */
    uint16_t bodyLength = (ringBufferHead[axis] - ringBufferTail[axis] + RING_BUFFER_SIZE) % RING_BUFFER_SIZE;

    if (bodyLength < RING_BUFFER_SIZE - GAP_HEAD_TAIL)
    {
        return (ringBufferHead[axis] + 1) % RING_BUFFER_SIZE;
    }
    else
        return UINT16_MAX;
}

void stepRingBufferIncrementHead(axis_t axis)
{
    uint16_t nextIndex = stepRingBufferGetNext(axis);

    if (nextIndex != UINT16_MAX)
    {
        ringBufferHead[axis] = nextIndex;
    }
}

uint16_t stepRingBufferGetTail(axis_t axis)
{
    if (ringBufferTail[axis] != ringBufferHead[axis])
    {
        return ringBufferTail[axis];
    }
    else
        return UINT16_MAX;
}

void stepRingBufferIncrementTail(axis_t axis)
{
    RING_BUFFER_INCREMENT_TAIL(axis, RING_BUFFER_SIZE);
}

/**
 * Get the free data address
 * @param axis Axis to get the free data address
 * @return Free data address; 0 if no data available
 */
uint32_t stepGetFreeDataAddress(axis_t axis)
{
    if (stepRingBufferGetNext(axis) == UINT16_MAX)
        return 0;

    uint16_t head = ringBufferHead[axis];

    switch (axis)
    {
    case X_AXIS:
        return (uint32_t)(&xPulseBuffer[head]);
    case Y_AXIS:
        return (uint32_t)(&yPulseBuffer[head]);
    case Z_AXIS:
        return (uint32_t)(&zPulseBuffer[head]);
    case NUM_DIMENSIONS:
    default:
        return 0;
    }
}

/**
 * Get the available data address
 * @param axis Axis to get the available data address
 * @return Available data address; 0 if no data available
 */
uint32_t stepGetAvailableDataAddress(axis_t axis)
{
    uint16_t tail = stepRingBufferGetTail(axis);

    if (tail == UINT16_MAX)
        return 0;

    stepRingBufferIncrementTail(axis);

    switch (axis)
    {
    case X_AXIS:
        return (uint32_t)(&xPulseBuffer[tail]);
    case Y_AXIS:
        return (uint32_t)(&yPulseBuffer[tail]);
    case Z_AXIS:
        return (uint32_t)(&zPulseBuffer[tail]);
    case NUM_DIMENSIONS:
    default:
        return 0;
    }
}

/* ===================================================================== */
/*                      Everything about Stepper                         */
/* ===================================================================== */

void stepWakeUp()
{
    // check if pulse calculation is disabled
    if (generalNotification & GENERAL_NOTIFICATION_FORCE_STOP)
    {
        // clear Force stop flag
        generalNotification &= ~GENERAL_NOTIFICATION_FORCE_STOP;

        if (!(generalNotification & GENERAL_NOTIFICATION_FIRST_TIME_START))
        {
            // start counter
            TIM_START_COUNTER(MASTER_TIM_HANDLE); // timer x axis
        }
    }

    // start pulse calculation
    stepEnablePulseCalculate();
}

void stepGoIdle()
{
    // stop counter
    TIM_STOP_COUNTER(MASTER_TIM_HANDLE); // timer x axis

    // set Force stop flag
    generalNotification |= GENERAL_NOTIFICATION_FORCE_STOP;

    // stop pulse calculation
    stepDisablePulseCalculate();
}

/**
 * @brief  Enable pulse calculation
 */
void stepEnablePulseCalculate()
{
    // clear general notification
    generalNotification |= GENERAL_NOTIFICATION_CALCULATE_PULSE;
}

/**
 * @brief  Disable pulse calculation
 */
void stepDisablePulseCalculate()
{
    // set general notification to no more segment which is triggered by stepper.c in grbl
    generalNotification &= ~GENERAL_NOTIFICATION_CALCULATE_PULSE;
}

/* ===================================================================== */
/*                      Everything about Timer                           */
/* ===================================================================== */

/**
 * @brief  Starts the TIM Output Compare signal generation in DMA mode.
 * @param  htim TIM Output Compare handle
 * @param  Channel TIM Channel to be enabled
 *          This parameter can be one of the following values:
 *            @arg TIM_CHANNEL_1: TIM Channel 1 selected
 *            @arg TIM_CHANNEL_2: TIM Channel 2 selected
 *            @arg TIM_CHANNEL_3: TIM Channel 3 selected
 *            @arg TIM_CHANNEL_4: TIM Channel 4 selected
 * @param  pData The source Buffer address.
 * @param  Length The length of data to be transferred from memory to TIM peripheral
 * @retval HAL status
 */
HAL_StatusTypeDef stepTimeOCStartDMA(TIM_HandleTypeDef *htim, uint32_t Channel, const uint32_t *pData,
                                     uint16_t Length)
{
    HAL_StatusTypeDef status = HAL_OK;
    //   uint32_t tmpsmcr;

    /* Check the parameters */
    assert_param(IS_TIM_CCX_INSTANCE(htim->Instance, Channel));

    /* Set the TIM channel state */
    if (TIM_CHANNEL_STATE_GET(htim, Channel) == HAL_TIM_CHANNEL_STATE_BUSY)
    {
        return HAL_BUSY;
    }
    else if (TIM_CHANNEL_STATE_GET(htim, Channel) == HAL_TIM_CHANNEL_STATE_READY)
    {
        if ((pData == NULL) || (Length == 0U))
        {
            return HAL_ERROR;
        }
        else
        {
            TIM_CHANNEL_STATE_SET(htim, Channel, HAL_TIM_CHANNEL_STATE_BUSY);
        }
    }
    else
    {
        return HAL_ERROR;
    }

    switch (Channel)
    {
    case TIM_CHANNEL_1:
    {
        /* Set the DMA compare callbacks */
        htim->hdma[TIM_DMA_ID_CC1]->XferCpltCallback = TIM_DMADelayPulseCplt;
        htim->hdma[TIM_DMA_ID_CC1]->XferHalfCpltCallback = TIM_DMADelayPulseHalfCplt;

        /* Set the DMA error callback */
        htim->hdma[TIM_DMA_ID_CC1]->XferErrorCallback = TIM_DMAError;

        /* Enable the DMA stream */
        if (HAL_DMA_Start_IT(htim->hdma[TIM_DMA_ID_CC1], (uint32_t)pData, (uint32_t)&htim->Instance->CCR1,
                             Length) != HAL_OK)
        {
            /* Return error status */
            return HAL_ERROR;
        }

        /* Enable the TIM Capture/Compare 1 DMA request */
        __HAL_TIM_ENABLE_DMA(htim, TIM_DMA_CC1);
        break;
    }

    case TIM_CHANNEL_2:
    {
        /* Set the DMA compare callbacks */
        htim->hdma[TIM_DMA_ID_CC2]->XferCpltCallback = TIM_DMADelayPulseCplt;
        htim->hdma[TIM_DMA_ID_CC2]->XferHalfCpltCallback = TIM_DMADelayPulseHalfCplt;

        /* Set the DMA error callback */
        htim->hdma[TIM_DMA_ID_CC2]->XferErrorCallback = TIM_DMAError;

        /* Enable the DMA stream */
        if (HAL_DMA_Start_IT(htim->hdma[TIM_DMA_ID_CC2], (uint32_t)pData, (uint32_t)&htim->Instance->CCR2,
                             Length) != HAL_OK)
        {
            /* Return error status */
            return HAL_ERROR;
        }

